In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("Titanic-Dataset.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df.drop(['PassengerId','Name','SibSp','Name','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
target=df.Survived
inputs=df.drop(['Survived'],axis='columns')

In [8]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [9]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [10]:
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [13]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [14]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,Y_test=train_test_split(inputs,target,test_size=0.3)

In [15]:
len(x_train)

623

In [34]:
len(x_test)

268

In [35]:
len(inputs)

891

In [16]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [17]:
model.fit(x_train,y_train)

GaussianNB()

In [18]:
model.score(x_test,Y_test)

0.7835820895522388

In [19]:
x_test[:10]

     Pclass        Age     Fare  female  male
437       2  24.000000  18.7500       1     0
255       3  29.000000  15.2458       1     0
186       3  29.699118  15.5000       1     0
784       3  25.000000   7.0500       0     1
744       3  31.000000   7.9250       0     1
591       1  52.000000  78.2667       1     0
349       3  42.000000   8.6625       0     1
745       1  70.000000  71.0000       0     1
593       3  29.699118   7.7500       1     0
129       3  45.000000   6.9750       0     1

In [20]:
Y_test[:10]

437    1
255    1
186    1
784    0
744    1
591    1
349    0
745    0
593    0
129    0
Name: Survived, dtype: int64

In [21]:
model.predict(x_test[:10])

array([1, 1, 1, 0, 0, 1, 0, 0, 1, 0], dtype=int64)

In [23]:
model.predict_proba(x_test[:10])

array([[0.01613419, 0.98386581],
       [0.03631985, 0.96368015],
       [0.03663919, 0.96336081],
       [0.98698824, 0.01301176],
       [0.98813068, 0.01186932],
       [0.00179674, 0.99820326],
       [0.98894955, 0.01105045],
       [0.77470842, 0.22529158],
       [0.03684703, 0.96315297],
       [0.98890531, 0.01109469]])